{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "sparse": false, "name": "input0"}, "inbound_nodes": []}, {"name": "conv2d_10.3997661275050012", "class_name": "Conv2D", "config": {"name": "conv2d_10.3997661275050012", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input0", 0, 0, {}]]]}, {"name": "240.4665722285125933", "class_name": "Activation", "config": {"name": "240.4665722285125933", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_10.3997661275050012", 0, 0, {}]]]}, {"name": "conv2d_20.1568010943645708", "class_name": "Conv2D", "config": {"name": "conv2d_20.1568010943645708", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["240.4665722285125933", 0, 0, {}]]]}, {"name": "350.8047129254156776_pad", "class_name": "ZeroPadding2D", "config": {"name": "350.8047129254156776_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_20.1568010943645708", 0, 0, {}]]]}, {"name": "350.8047129254156776", "class_name": "MaxPooling2D", "config": {"name": "350.8047129254156776", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["350.8047129254156776_pad", 0, 0, {}]]]}, {"name": "conv2d_30.5515465677385728", "class_name": "Conv2D", "config": {"name": "conv2d_30.5515465677385728", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["350.8047129254156776", 0, 0, {}]]]}, {"name": "510.498628700133222", "class_name": "Activation", "config": {"name": "510.498628700133222", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_30.5515465677385728", 0, 0, {}]]]}, {"name": "conv2d_40.4341517738725472", "class_name": "Conv2D", "config": {"name": "conv2d_40.4341517738725472", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["510.498628700133222", 0, 0, {}]]]}, {"name": "620.8454056688503269", "class_name": "Activation", "config": {"name": "620.8454056688503269", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_40.4341517738725472", 0, 0, {}]]]}, {"name": "630.17248886348708659_pad", "class_name": "ZeroPadding2D", "config": {"name": "630.17248886348708659_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["620.8454056688503269", 0, 0, {}]]]}, {"name": "630.17248886348708659", "class_name": "MaxPooling2D", "config": {"name": "630.17248886348708659", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["630.17248886348708659_pad", 0, 0, {}]]]}, {"name": "690.284288926971331", "class_name": "Reshape", "config": {"name": "690.284288926971331", "trainable": true, "dtype": "float32", "target_shape": [-1]}, "inbound_nodes": [[["630.17248886348708659", 0, 0, {}]]]}, {"name": "dense_10.6848349087517801", "class_name": "Dense", "config": {"name": "dense_10.6848349087517801", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["690.284288926971331", 0, 0, {}]]]}, {"name": "760.47716843275070087", "class_name": "Activation", "config": {"name": "760.47716843275070087", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_10.6848349087517801", 0, 0, {}]]]}, {"name": "dense_20.15725084562405733", "class_name": "Dense", "config": {"name": "dense_20.15725084562405733", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["760.47716843275070087", 0, 0, {}]]]}, {"name": "810.23189742563692672", "class_name": "Activation", "config": {"name": "810.23189742563692672", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_20.15725084562405733", 0, 0, {}]]]}, {"name": "dense_30.27425921183387203", "class_name": "Dense", "config": {"name": "dense_30.27425921183387203", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["810.23189742563692672", 0, 0, {}]]]}], "input_layers": [["input0", 0, 0]], "output_layers": [["dense_30.27425921183387203", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}